benchmarkResults/highload_http.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmark.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m0s max duration (incl. graceful stop):
              * highload_http: Up to 200 looping VUs for 30s over 4 stages (gracefulRampDown: 30s, exec: highLoadHttp, gracefulStop: 30s)


running (0m01.0s), 009/200 VUs, 11385 complete and 0 interrupted iterations
highload_http   [   3% ] 009/200 VUs  01.0s/30.0s

running (0m02.0s), 019/200 VUs, 27137 complete and 0 interrupted iterations
highload_http   [   7% ] 019/200 VUs  02.0s/30.0s

running (0m03.0s), 029/200 VUs, 54505 complete and 0 interrupted iterations
highload_http   [  10% ] 029/200 VUs  03.0s/30.0s

running (0m04.0s), 039/200 VUs, 83640 complete and 0 interrupted iterations
highload_http   [  13% ] 039/200 VUs  04.0s/30.0s

running (0m05.0s), 049/200 VUs, 114240 complete and 0 interrupted iterations
highload_http   [  17% ] 049/200 VUs  05.0s/30.0s

running (0m06.0s), 059/200 VUs, 141815 complete and 0 interrupted iterations
highload_http   [  20% ] 059/200 VUs  06.0s/30.0s

running (0m07.0s), 069/200 VUs, 169940 complete and 0 interrupted iterations
highload_http   [  23% ] 069/200 VUs  07.0s/30.0s

running (0m08.0s), 079/200 VUs, 202727 complete and 0 interrupted iterations
highload_http   [  27% ] 079/200 VUs  08.0s/30.0s

running (0m09.0s), 089/200 VUs, 235432 complete and 0 interrupted iterations
highload_http   [  30% ] 089/200 VUs  09.0s/30.0s

running (0m10.0s), 099/200 VUs, 267109 complete and 0 interrupted iterations
highload_http   [  33% ] 099/200 VUs  10.0s/30.0s

running (0m11.0s), 109/200 VUs, 302047 complete and 0 interrupted iterations
highload_http   [  37% ] 109/200 VUs  11.0s/30.0s

running (0m12.0s), 119/200 VUs, 335891 complete and 0 interrupted iterations
highload_http   [  40% ] 119/200 VUs  12.0s/30.0s

running (0m13.0s), 129/200 VUs, 371375 complete and 0 interrupted iterations
highload_http   [  43% ] 129/200 VUs  13.0s/30.0s

running (0m14.0s), 139/200 VUs, 406025 complete and 0 interrupted iterations
highload_http   [  47% ] 139/200 VUs  14.0s/30.0s

running (0m15.0s), 149/200 VUs, 439739 complete and 0 interrupted iterations
highload_http   [  50% ] 149/200 VUs  15.0s/30.0s

running (0m16.0s), 159/200 VUs, 474610 complete and 0 interrupted iterations
highload_http   [  53% ] 159/200 VUs  16.0s/30.0s

running (0m17.0s), 169/200 VUs, 509554 complete and 0 interrupted iterations
highload_http   [  57% ] 169/200 VUs  17.0s/30.0s

running (0m18.0s), 179/200 VUs, 545455 complete and 0 interrupted iterations
highload_http   [  60% ] 179/200 VUs  18.0s/30.0s

running (0m19.0s), 189/200 VUs, 581965 complete and 0 interrupted iterations
highload_http   [  63% ] 189/200 VUs  19.0s/30.0s

running (0m20.0s), 199/200 VUs, 618623 complete and 0 interrupted iterations
highload_http   [  67% ] 199/200 VUs  20.0s/30.0s

running (0m21.0s), 200/200 VUs, 654926 complete and 0 interrupted iterations
highload_http   [  70% ] 200/200 VUs  21.0s/30.0s

running (0m22.0s), 200/200 VUs, 690876 complete and 0 interrupted iterations
highload_http   [  73% ] 200/200 VUs  22.0s/30.0s

running (0m23.0s), 200/200 VUs, 727318 complete and 0 interrupted iterations
highload_http   [  77% ] 200/200 VUs  23.0s/30.0s

running (0m24.0s), 200/200 VUs, 763729 complete and 0 interrupted iterations
highload_http   [  80% ] 200/200 VUs  24.0s/30.0s

running (0m25.0s), 200/200 VUs, 799809 complete and 0 interrupted iterations
highload_http   [  83% ] 200/200 VUs  25.0s/30.0s

running (0m26.0s), 200/200 VUs, 835313 complete and 0 interrupted iterations
highload_http   [  87% ] 200/200 VUs  26.0s/30.0s

running (0m27.0s), 200/200 VUs, 871002 complete and 0 interrupted iterations
highload_http   [  90% ] 200/200 VUs  27.0s/30.0s

running (0m28.0s), 200/200 VUs, 907244 complete and 0 interrupted iterations
highload_http   [  93% ] 200/200 VUs  28.0s/30.0s

running (0m29.0s), 200/200 VUs, 943530 complete and 0 interrupted iterations
highload_http   [  97% ] 200/200 VUs  29.0s/30.0s

running (0m30.0s), 200/200 VUs, 976754 complete and 0 interrupted iterations
highload_http   [ 100% ] 200/200 VUs  30.0s/30.0s
     ✓ [highload_http] status 200

     checks.........................: 100.00% ✓ 978127       ✗ 0     
     data_received..................: 636 MB  21 MB/s
     data_sent......................: 86 MB   2.9 MB/s
     http_req_blocked...............: avg=1.44µs  min=0s       med=1µs    max=18.01ms p(90)=2µs    p(95)=2µs   
     http_req_connecting............: avg=76ns    min=0s       med=0s     max=3.66ms  p(90)=0s     p(95)=0s    
   ✓ http_req_duration..............: avg=4.02ms  min=129µs    med=3.66ms max=83.7ms  p(90)=6.93ms p(95)=8.32ms
       { expected_response:true }...: avg=4.02ms  min=129µs    med=3.66ms max=83.7ms  p(90)=6.93ms p(95)=8.32ms
     http_req_failed................: 0.00%   ✓ 0            ✗ 978127
     http_req_receiving.............: avg=15.77µs min=3µs      med=6µs    max=43.05ms p(90)=18µs   p(95)=30µs  
     http_req_sending...............: avg=5.19µs  min=1µs      med=2µs    max=19.57ms p(90)=5µs    p(95)=8µs   
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s     max=0s      p(90)=0s     p(95)=0s    
     http_req_waiting...............: avg=3.99ms  min=119µs    med=3.64ms max=83.7ms  p(90)=6.9ms  p(95)=8.28ms
     http_reqs......................: 978127  32600.438642/s
     iteration_duration.............: avg=4.07ms  min=150.37µs med=3.71ms max=83.73ms p(90)=7ms    p(95)=8.41ms
     iterations.....................: 978127  32600.438642/s
     vus............................: 200     min=9          max=200 
     vus_max........................: 200     min=200        max=200 
running (0m30.0s), 000/200 VUs, 978127 complete and 0 interrupted iterations
highload_http ✓ [ 100% ] 000/200 VUs  30s